{
  "PalatePal": 
  [
    {
      "DishName": "Creamy Penne Pasta",
      "DishType": "Italian",
      "RecipeImage": "https://github.com/amalgohar/palatepal/blob/main/img/penne.jpg",
      "Ingredients": "8 oz uncooked pasta, 2 tablespoons butter, 2-3 cloves garlic minced, 2 tablespoons tomato paste, 1 (14 ounce) can tomato sauce, 3/4 cup heavy/whipping cream, 1/4 teaspoon Italian seasoning, Freshly grated parmesan cheese for serving, to taste.",
      "RecipeDescription": "Yields 4 servings: In a large pot, boil salted water and cook pasta until al dente. Simultaneously, melt butter in a skillet, sauté garlic, then add tomato paste, tomato sauce, cream, and Italian seasoning. Cook until the sauce thickens, season with salt, pepper, and a pinch of sugar if desired. Toss with cooked pasta and serve with Parmesan cheese.",
      "RecipeVideo": "www.youtube.com"
    },
    {
      "DishName": "Garlic Shrimp Spaghetti",
      "DishType": "Italian",
      "RecipeImage": "https://github.com/amalgohar/palatepal/blob/main/img/shrimp.jpg",
      "Ingredients": "2 tablespoons olive oil, 1 tsp Cajun seasoning mix, 1 yellow onion cut into 1/2-inch pieces, 4 cloves garlic minced, 1 & 14.5 oz can diced tomatoes, 8 oz spaghetti pasta, ½ lb raw shrimp, peeled, deveined, and tails removed (31-40 ct), ½ cup heavy cream.",
      "RecipeDescription": "Yields 4 servings: Begin by cooking spaghetti until al dente, then drain and set aside. In a skillet, heat olive oil over medium-high heat and add minced garlic, sautéing until fragrant and lightly golden. Next, add the shrimp and cook until pink and are cooked through. To finish, toss cooked spaghetti with garlic shrimp, a drizzle of lemon juice, and a sprinkle of fresh parsley for a burst of flavor.",
      "RecipeVideo": "www.youtube.com"
    },
    {
      "DishName": "Beef & Tomato Pizza",
      "DishType": "Italian",
      "RecipeImage": "https://github.com/amalgohar/palatepal/blob/main/img/pizza.jpg",
      "Ingredients": "1 lb dough, 1/2 cup tomato sauce, 1 lb ground beef, 1 cup shredded mozzarella, 1/2 cup sliced tomatoes, 1/4 cup diced onions, 2 garlic cloves minced, 1 tsp dried oregano, Salt and pepper, Fresh basil leaves for garnish.",
      "RecipeDescription": "Yields 4 servings: Preheat oven to 450°F. Roll out dough on floured surface and place on pan. Spread tomato sauce on dough, leaving a border for crust. Brown ground beef, drain, and season with garlic, oregano, salt, and pepper. Sprinkle shredded mozzarella over sauce, add seasoned beef, sliced tomatoes, and diced onions as toppings. Bake for 12-15 min until crust is golden and cheese is bubbly, garnish with fresh basil if desired.",
      "RecipeVideo": "www.youtube.com"
    },
    {
      "DishName": "Meatball Angel Hair Pasta",
      "DishType": "Italian",
      "RecipeImage": "https://github.com/amalgohar/palatepal/blob/main/img/spaghetti.jpg",
      "Ingredients": "1 lb ground beef, 1/2 cup breadcrumbs, 1 egg, 1 tsp garlic powder, salt and pepper to taste, 2 cups tomato sauce, 1 tbsp Italian herbs, angel hair pasta, 1/2 cup grated Parmesan, and fresh parsley for garnish.",
      "RecipeDescription": "Yields 4 servings: Preheat oven to 400°F. Cook angel hair according to package instructions. In a bowl, mix ground beef with breadcrumbs, egg, garlic powder, salt, and pepper. Form into meatballs and bake for 20 minutes. Simmer tomato sauce with Italian herbs. Cook angel hair and toss with sauce. Serve meatballs on top, garnished with grated Parmesan and fresh parsley.",
      "RecipeVideo": "www.youtube.com"
    },
    {
      "DishName": "Farfalle al Pesto",
      "DishType": "Italian",
      "RecipeImage": "https://github.com/amalgohar/palatepal/blob/main/img/farfalle.jpg",
      "Ingredients": "2 ounces farfalle pasta, 2 cups fresh basil leaves, 3 garlic cloves, 1/4 cup pine nuts, 1/2 cup grated Parmesan cheese, 1/2 cup olive oil, Salt and pepper to taste",
      "RecipeDescription": "Yields 4 servings: Cook the farfalle pasta until al dente, and in a blender, combine the fresh basil leaves, garlic cloves, pine nuts, Parmesan cheese, and olive oil. Blend until a smooth green sauce forms. Toss the cooked pasta with the pesto sauce, ensuring even coating. Season with salt and pepper to taste. Serve the Farfalle al Pesto garnished with additional Parmesan if desired.",
      "RecipeVideo": "www.youtube.com"
    }
  ],
  "Status": "OK"
}
